//Напишите программу, которая считывает из консоли ваше имя и выводит
//приветственное сообщение.

string name = Console.ReadLine();

Console.WriteLine(name);
