//Напишите программу, которая вычисляет формулу площади круга и выводит
//результат на экран консоли с понятным сообщением. Число π запишите как
//константу и используйте её в формуле. Радиус запишите как переменную.
//Считывать из консоли ничего не нужно.


float pip = 3.14f;
int rad = 4;

Console.WriteLine($"Площадь круга ровна {2 * pip * rad}");